Revit 2027 API
BuiltInFailures.SketchFailures.UnsatisfiedWallAssocProp Property
 Constraint between a Line created with Pick Wall and the Wall is not satisfied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnsatisfiedWallAssocProp { get; }
Public Shared ReadOnly Property UnsatisfiedWallAssocProp As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnsatisfiedWallAssocProp {
	FailureDefinitionId^ get ();
}
static member UnsatisfiedWallAssocProp : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace